driver-tests/bpelse/dynamicpartnerlink/dynamicPartnerLinkJBI/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:helloObj xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns:msgns="http://j2ee.netbeans.org/wsdl/dynamicPartnerLink" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns1="http://xml.netbeans.org/schema/dataTypes.xsd">
      <dat:string> In Sub BP  In Sub BP  Input from the test case </dat:string>
    </ns1:helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
