driver-tests/bpelse/dynamicpartnerlink/justhttpAndBPEL-JBI/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd">
      <ns0:string xmlns:ns0="http://xml.netbeans.org/schema/dataTypes.xsd">?string? after invoke 1 ?string? in provide BP  after invoke 0 ?string? in provide BP </ns0:string>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
