driver-tests/bpelse/dynamicpartnerlink/correlation/MatchingInstanceTwoCorrJBI/test/results/RepRecRecInitNo/Actual_20130314140255_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns:msgns="http://j2ee.netbeans.org/wsdl/RepRecRecInitNo_DriverWSDL">
      <string>*InputText**InputText**InputText*</string>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>